app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    begin
      @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "11"]]

  def index
    # how to set condition
        # through redirect

    # when to redirect??
       #  filter,then select
          # params[:ratings] is nil but flash[:ratings] is seted
          # so I should redirect with wright params

    redirect_to :ratings => flash[:ratings],:sort => params[:sort] and return  if flash[:ratings] != nil and params[:ratings] == nil
    redirect_to :ratings => params[:ratings],:sort => flash[:sort] and return  if params[:sort] == nil and flash[:sort] != nil
    # get things wright
    @all_ratings = Movie.all_ratings
    ### here ########
    @selected_ratings = params[:ratings] ||flash[:ratings] || {}
    ###############
    if @selected_ratings == {}
      @all_ratings.each {|rating| @selected_ratings[rating] = 1}
---
SELECT "movies".* FROM "movies" WHERE (rating = 'G' or rating = 'NC-17' or rating = 'PG' or rating = 'PG-13' or rating = 'R' ) ORDER BY release_date

  def create
    @movie = Movie.new(params[:movie])
    if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)